ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/ble.c
char* fetch_name(uint16_t length)
{
    char* name = malloc(sizeof(char[MAX_STRING_SIZE])); //max size of name string

    for(int i = 0; i < length; i++)
    {
        *(name + i) = nus_data_global[parser_trace + i];  
    }

    memset((name + length), NULL, (MAX_STRING_SIZE - length)); 
    string_length = length; 
    parser_trace += length;

    return name; 
}


uint32_t char_string_to_int(uint8_t digits)
{   
    char num_string[digits];
    uint8_t hex_bcd[digits]; 
    uint32_t accumulator = 0; 

    for(int i = 0; i < digits; i++)
    {
        num_string[i] = nus_data_global[parser_trace + i];
        hex_bcd[i] = num_string[i] - 0x30; 
        accumulator += (hex_bcd[i] * pow(10, digits-i-1)); 
    }
    return accumulator; 
}



char* ble_parse_name(void) //pass in all offsets
{
    //char string_len[2];
    char *name;

    uint32_t data_length = ble_parse_data_length(); 
    name = fetch_name(data_length); //offset is 6 

    return name;
} 



uint32_t ble_parse_data_length(void)
{
    char num_chars = nus_data_global[parser_trace]; //ascii for number of characters in length 
    parser_trace += 1;
    uint8_t i = num_chars - 0x30; //get int from ascii 
    uint32_t data_length = char_string_to_int(i);
    parser_trace += i; 

    return data_length;
}


void add_project(void)
{   
    char *project_name;
    uint8_t project_name_length;
    project_name = ble_parse_name(); 
    project_name_length = string_length; //not used 
    
    //1. write project string and chip_num 0 to project sector 
    //2. add project address to directory project_num x word_size
    //3. increment directory/project cnt
     
    uint32_t num_projects;
    uint8_t num_projects_buff[WORD_SIZE];
    uint8_t project_addr_buff[WORD_SIZE]; 
    uint8_t sector_buff[FLASH_SECTOR_SIZE]; //buffer directory for modification

    flash_read(num_projects_buff, ADDR_NUM_PROJECTS, WORD_SIZE); //read project_num total
    num_projects = num_projects_buff[0] << 24 | num_projects_buff[1] << 16 | num_projects_buff[2] << 8 | num_projects_buff[3];

    flash_read(sector_buff, PROJECTS_START_ADDR, FLASH_SECTOR_SIZE); //buffer project sector for modification
    flash_erase(PROJECTS_START_ADDR, NRF_QSPI_ERASE_LEN_4KB);
    uint8_t chip_num_init[WORD_SIZE] = {0, 0, 0, 0};
    uint32_t project_addr_sector = num_projects * MAX_PROJECT_SIZE;
    memcpy(&sector_buff[project_addr_sector], project_name, MAX_STRING_SIZE); // copy project name string to buffer
    memcpy(&sector_buff[project_addr_sector + MAX_STRING_SIZE], chip_num_init, WORD_SIZE); // copy chip_num to buffer
    flash_write(sector_buff, PROJECTS_START_ADDR, FLASH_SECTOR_SIZE); //rewrite modified sector buffer


    uint32_t new_project_addr = (num_projects * MAX_PROJECT_SIZE) + PROJECTS_START_ADDR; //calc new project start address 
    uint32_t new_project_dir_addr = (num_projects * WORD_SIZE) + ADDR_PROJECT_PTR_FIRST; //project addr in directory
    num_projects++; //increment num projects


    flash_read(sector_buff, DIRECTORY_START_ADDR, FLASH_SECTOR_SIZE);
    flash_erase(DIRECTORY_START_ADDR, NRF_QSPI_ERASE_LEN_4KB); 

    sector_buff[0] = (num_projects >> 24) & 0xFF;  
    sector_buff[1] = (num_projects >> 16) & 0xFF;
    sector_buff[2] = (num_projects >> 8) & 0xFF;
    sector_buff[3] = num_projects & 0xFF;

    sector_buff[new_project_dir_addr] = (new_project_addr >> 24) & 0xFF;  
    sector_buff[new_project_dir_addr+1] = (new_project_addr >> 16) & 0xFF;
    sector_buff[new_project_dir_addr+2] = (new_project_addr >> 8) & 0xFF;
    sector_buff[new_project_dir_addr+3] = new_project_addr & 0xFF;

    flash_write(sector_buff, DIRECTORY_START_ADDR, FLASH_SECTOR_SIZE); //rewrite directory
}


void add_chip(void)
{
    char *chip_name;
    uint8_t chip_name_length; // not used 
    char *project_name;
    uint8_t project_name_length;
    uint8_t chip_id[WORD_SIZE] = {0, 0, 0, 0}; //TODO fetch actual chip ID 

    chip_name = ble_parse_name();
    chip_name_length = string_length;
    
    project_name = ble_parse_name();
    project_name_length = string_length;

    //Seek to parent based on name
    uint32_t project_addr = seek_to_project(project_name, project_name_length); //projects start at 4096, 52 bytes per project 
    if(project_addr == NULL)
    {   
        //ERROR: no project found
        nrf_gpio_pin_set(LED_RED);
    }
            // add chip to flash
    //1. read chip_count_global, add chip to chip sector with file_num = 0
    //2. increment chip_count_global in directory
    //3. increment chip_num and chip_addr_pointer in parent project
    uint32_t num_chips_global;
    uint8_t num_chips_buff[WORD_SIZE];
    uint8_t chip_addr_buff[WORD_SIZE]; 
    uint8_t sector_buff[CHIP_SECTOR_SIZE];

    flash_read(num_chips_buff, CHIP_COUNT_GLOBAL_ADDR, WORD_SIZE); //read chip_num_global total
    num_chips_global = num_chips_buff[0] << 24 | num_chips_buff[1] << 16 | num_chips_buff[2] << 8 | num_chips_buff[3];
    
    //update chip sector with new chip data
    uint8_t file_num_init[WORD_SIZE] = {0, 0, 0, 0};
    uint32_t new_chip_sector_addr = num_chips_global * MAX_CHIP_SIZE;
    flash_read(sector_buff, CHIPS_START_ADDR, CHIP_SECTOR_SIZE);
    flash_erase(CHIPS_START_ADDR, NRF_QSPI_ERASE_LEN_4KB); //erase first sector 
    flash_erase(CHIPS_START_ADDR + FLASH_SECTOR_SIZE, NRF_QSPI_ERASE_LEN_4KB); //erase second sector 
    flash_erase(CHIPS_START_ADDR + (2*FLASH_SECTOR_SIZE), NRF_QSPI_ERASE_LEN_4KB); //erase third sector 
    memcpy(&sector_buff[new_chip_sector_addr], chip_name, MAX_STRING_SIZE); //copy new chip name into sector
    memcpy(&sector_buff[new_chip_sector_addr + MAX_STRING_SIZE], chip_id, WORD_SIZE); // chip_id
    memcpy(&sector_buff[new_chip_sector_addr + FILE_NUM_OFFSET], file_num_init, WORD_SIZE); // file_num = 0
    flash_write(sector_buff, CHIPS_START_ADDR, CHIP_SECTOR_SIZE); // rewrite sector 
    
    //update directory
    flash_read(sector_buff, DIRECTORY_START_ADDR, FLASH_SECTOR_SIZE); 
    flash_erase(DIRECTORY_START_ADDR, NRF_QSPI_ERASE_LEN_4KB);
    num_chips_global++;
    sector_buff[CHIP_COUNT_GLOBAL_ADDR] = (num_chips_global >> 24) & 0xFF;  
    sector_buff[CHIP_COUNT_GLOBAL_ADDR+1] = (num_chips_global >> 16) & 0xFF;
    sector_buff[CHIP_COUNT_GLOBAL_ADDR+2] = (num_chips_global >> 8) & 0xFF;
    sector_buff[CHIP_COUNT_GLOBAL_ADDR+3] = num_chips_global & 0xFF;
    flash_write(sector_buff, DIRECTORY_START_ADDR, FLASH_SECTOR_SIZE);

