ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/ble.c
    //update parent project
    uint32_t new_chip_addr = new_chip_sector_addr + CHIPS_START_ADDR;
    flash_read(sector_buff, PROJECTS_START_ADDR, FLASH_SECTOR_SIZE); 
    flash_erase(PROJECTS_START_ADDR, NRF_QSPI_ERASE_LEN_4KB);
    //add chip_addr_ptr to project
    uint32_t project_sector_addr = project_addr - PROJECTS_START_ADDR; 
    uint32_t num_chips_project = sector_buff[project_sector_addr + CHIP_NUM_OFFSET] << 24 | sector_buff[project_sector_addr + CHIP_NUM_OFFSET + 1] << 16 | sector_buff[project_sector_addr + CHIP_NUM_OFFSET + 2] << 8 | sector_buff[project_sector_addr + CHIP_NUM_OFFSET + 3];
    uint32_t chip_ptr_addr = PROJECT_HEADER_SIZE + (num_chips_project * WORD_SIZE);
    sector_buff[project_sector_addr + chip_ptr_addr] = (new_chip_addr >> 24) & 0xFF;  
    sector_buff[project_sector_addr + chip_ptr_addr+1] = (new_chip_addr >> 16) & 0xFF;
    sector_buff[project_sector_addr + chip_ptr_addr+2] = (new_chip_addr >> 8) & 0xFF;
    sector_buff[project_sector_addr + chip_ptr_addr+3] = new_chip_addr & 0xFF;
    //increment chip_num in project
    num_chips_project++;
    sector_buff[project_sector_addr + CHIP_NUM_OFFSET] = (num_chips_project >> 24) & 0xFF;  
    sector_buff[project_sector_addr + CHIP_NUM_OFFSET+1] = (num_chips_project >> 16) & 0xFF;
    sector_buff[project_sector_addr + CHIP_NUM_OFFSET+2] = (num_chips_project >> 8) & 0xFF;
    sector_buff[project_sector_addr + CHIP_NUM_OFFSET+3] = num_chips_project & 0xFF;
    flash_write(sector_buff, PROJECTS_START_ADDR, FLASH_SECTOR_SIZE);

//NOTE FOR TEST 
// uint8_t data_buff[FLASH_SECTOR_SIZE];
// flash_read(data_buff, PROJECTS_START_ADDR, FLASH_SECTOR_SIZE);
// prog_flag = true;
}



uint32_t add_file(void)
{
    char* file_name;
    uint8_t file_name_length; 
    char* chip_name;
    uint8_t chip_name_length;
    char* project_name;
    uint8_t project_name_length;
     
    file_name = ble_parse_name();
    file_name_length = string_length; 
    chip_name = ble_parse_name();
    chip_name_length = string_length;
    project_name = ble_parse_name();
    project_name_length = string_length;

    file_data_length = ble_parse_data_length(); 
    
    prog_flag = true; //flags nus handler to start appending incoming data 
    
    // flash seek functions
    uint32_t project_addr = seek_to_project(project_name, project_name_length); //projects start at 4096, 52 bytes per project 
    if(project_addr == NULL)
    {   
        //ERROR: no project found
        nrf_gpio_pin_set(LED_RED);
    }
    uint32_t chip_addr = seek_to_chip(project_addr, chip_name, chip_name_length); //chips start at addr 8192, 56 bytes per chip 
    if(chip_addr == NULL)
    {   
        //ERROR: no chip found
        nrf_gpio_pin_set(LED_RED);
    }

    file_header_write(chip_addr, file_name, NULL, file_data_length); //write file header and append file addr to chip 
    
    return chip_addr; 
} 


void packet_write_first(void)
{
    //read file bytes programmed
    //update file in flash with data_address?
    //append data as its received 
    //increment global file counter  
     
    uint32_t bytes_prog = fetch_bytes_prog(); 
    file_data_addr_global = bytes_prog + DATA_SECTOR_START; 
    flash_write(nus_data_global, file_data_addr_global, BLE_PACKET_SIZE); //NOTE WORD WRITES ONLY, write remaining file data from first ble packet after header
}

void packet_write(uint32_t data_start_addr)
{
    flash_write(nus_data_global, data_start_addr, BLE_PACKET_SIZE);
}


void ble_cmd_parser(void)
{
    if(nus_data_global[0] == 'C' && nus_data_global[1] == 'C') //start byte == "CC" 
    {
        char cmd[2]; 

        cmd[0] = nus_data_global[2];
        cmd[1] = nus_data_global[3];
        parser_trace = 4; 

        if(cmd[0] == '1' && cmd[1] =='0') //add project 
        {
            add_project(); 
        }
        else if(cmd[0] == '2' && cmd[1] =='0') //add chip 
        {
            // add chip to parent project in flash
            add_chip(); 
        }
        else if(cmd[0] == '3' && cmd[1] =='0') //add file 
        {
            // add file to parent chip and project in flash
            chip_addr_global = add_file(); 
        }
        else if(cmd[0] == '0' && cmd[0] =='0') //add all
        {
            // add_all(); 
        }
        else if(cmd[0] == '4' && cmd[1] =='0') //delete project 
        {
            //delete_project();
        }
        else if(cmd[0] == '5' && cmd[1] =='0') //delete chip 
        {
            //delete_chip(); 
        }
        else if(cmd[0] == '6' && cmd[1] =='0') //delete file
        {
            //delete_file(); //NOTE: how to reuse empty data storage after deletion?
        }
        else if(cmd[0] == 'F' && cmd[1] =='F') //erase device
        {
            flash_init(); //reset flash
            hibernate(); // reset device
        }
        //TODO free names after writing to flash

        parser_trace = 0; //reset for next command
    }
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */

void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {        
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            nus_data_global[i] = p_evt->params.rx_data.p_data[i];
        }
        if(!prog_flag)
        {
            ble_cmd_parser(); 
            current_byte_pos = file_data_length;
        }
        else // prog flag true, start file write
        {
           if(current_byte_pos > 0)
            {   
                if(packet_index == 0)
                {
                    packet_write_first(); //calculate start address and write first packet
                    packet_index++;
                    current_byte_pos -= BLE_PACKET_SIZE; // subtract bytes programmed 
                }
                else
                {
                    uint32_t current_addr = (packet_index * BLE_PACKET_SIZE) + file_data_addr_global; //global assigned in packet_write_first(); 
                    packet_write(current_addr); 

                    //append entire nus_data_global array to file data in flash
                    //exception for last file (not full 244 bytes) 

                    packet_index++;
                    current_byte_pos -= BLE_PACKET_SIZE; 
                }
            }
            if(current_byte_pos <= 0)
            {
                //(AFTER PROGRAMMING COMPLETE)
                prog_flag = false;
               
                flash_file_num_inc(chip_addr_global);  //increment file_num in chip parent in flash
                flash_file_dir_update(file_data_length); //increment file_count_global and file_bytes_programmed in flash
                
                //NOTE FOR TEST 
//                uint8_t data_buff[FLASH_SECTOR_SIZE];
//                flash_read(data_buff, 0, FLASH_SECTOR_SIZE);
//                prog_flag = true;
            }
        }
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

